shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/app/silent_ota/silent_ota_application.c
    return app_result;
}


static T_APP_RESULT app_ota_srv_cb(T_OTA_CALLBACK_DATA *p_data)
{
    T_APP_RESULT app_result = APP_RESULT_SUCCESS;
    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            if (OTA_WRITE_CHAR_VAL == p_data->msg_data.write.opcode &&
                OTA_VALUE_ENTER == p_data->msg_data.write.u.value)
            {
                /*battery level is above 60 percent*/
                APP_PRINT_INFO0("Preparing switch into OTA mode");
                /*prepare to enter OTA mode, before switch action, we should disconnect first.*/
                switch_to_ota_mode_pending = true;
                le_disconnect(0);
            }
        }
        break;
    default:
        break;
    }
    return app_result;
}

static T_APP_RESULT app_dfu_srv_cb(T_DFU_CALLBACK_DATA *p_data)
{
    T_APP_RESULT app_result = APP_RESULT_SUCCESS;
    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            if (p_data->msg_data.notification_indification_index == DFU_NOTIFY_ENABLE)
            {
                APP_PRINT_INFO0("dfu notification enable");
            }
            else if (p_data->msg_data.notification_indification_index ==
                     DFU_NOTIFY_DISABLE)
            {
                APP_PRINT_INFO0("dfu notification disable");
            }
        }
        break;
    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            uint8_t dfu_write_opcode = p_data->msg_data.write.opcode;
            if (dfu_write_opcode == DFU_WRITE_ATTR_EXIT)
            {
                if (p_data->msg_data.write.write_attrib_index == INDEX_DFU_CONTROL_POINT_CHAR_VALUE)
                {
                    uint8_t control_point_opcode = *p_data->msg_data.write.p_value;
                    switch (control_point_opcode)
                    {
                    case DFU_OPCODE_VALID_FW:
                        {
                            T_IO_MSG dfu_valid_fw_msg;
                            dfu_valid_fw_msg.type = IO_MSG_TYPE_DFU_VALID_FW;
                            dfu_valid_fw_msg.u.param = p_data->conn_id;
                            if (app_send_msg_to_apptask(&dfu_valid_fw_msg) == false)
                            {
                                DBG_DIRECT("DFU send Valid FW msg fail!");
                            }
                        }
                        break;
                    case DFU_OPCODE_ACTIVE_IMAGE_RESET:
                        {
#if (ENABLE_AUTO_BANK_SWITCH == 1)
                            if (is_ota_support_bank_switch())
                            {
                                uint32_t ota_addr;
                                ota_addr = get_header_addr_by_img_id(OTA);
                                DFU_PRINT_INFO1("DFU_OPCODE_ACTIVE_IMAGE_RESET: Bank switch erase ota_addr=0x%x", ota_addr);
                                unlock_flash_bp_all();
                                flash_erase_locked(FLASH_ERASE_SECTOR, ota_addr);
                                lock_flash_bp();
                            }
#endif
                            le_disconnect(0);
                            dfu_active_rst_pending = true;
                        }
                        break;
                    default:
                        break;
                    }
                }
            }
            else if (dfu_write_opcode == DFU_WRITE_FAIL)
            {
                DBG_DIRECT("DFU FAIL!");
            }
            else if (dfu_write_opcode == DFU_WRITE_ATTR_ENTER)
            {
                // application can add check conditions before start dfu procefure
                //if check fail, return some error code except APP_RESULT_SUCCESS to exit dfu procedure
                //app_result = APP_RESULT_REJECT;
                //APP_PRINT_INFO0("exit dfu procedure");
            }
            else
            {
            }
        }
        break;
    default:
        break;
    }

    return app_result;
}

/** @defgroup  PERIPH_SEVER_CALLBACK Profile Server Callback Event Handler
    * @brief Handle profile server callback event
    * @{
    */
/**
    * @brief    All the BT Profile service callback events are handled in this function
    * @note     Then the event handling function shall be called according to the
    *           service_id
    * @param    service_id  Profile service ID
    * @param    p_data      Pointer to callback data
    * @return   T_APP_RESULT, which indicates the function call is successful or not
    * @retval   APP_RESULT_SUCCESS  Function run successfully
    * @retval   others              Function run failed, and return number indicates the reason
    */
T_APP_RESULT app_profile_callback(T_SERVER_ID service_id, void *p_data)
{
    T_APP_RESULT app_result = APP_RESULT_SUCCESS;
    if (service_id == SERVICE_PROFILE_GENERAL_ID)
    {
        app_result = app_general_srv_cb((T_SERVER_APP_CB_DATA *)p_data);
    }
    else if (service_id == g_bas_service_id)
    {
        app_result = app_bas_srv_cb((T_BAS_CALLBACK_DATA *)p_data);
    }
    else if (service_id == g_dis_service_id)
    {
        app_result = app_dis_srv_cb((T_DIS_CALLBACK_DATA *)p_data);
    }
    else if (service_id == g_ota_service_id)
    {
        app_result = app_ota_srv_cb((T_OTA_CALLBACK_DATA *)p_data);
    }
    else if (service_id == g_dfu_service_id)
    {
        app_result = app_dfu_srv_cb((T_DFU_CALLBACK_DATA *)p_data);
    }

    return app_result;
}

/** @} */ /* End of group PERIPH_SEVER_CALLBACK */
/** @} */ /* End of group PERIPH_APP */
